src/cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing @desserts
#+TAGS: GF(g) easy(e) fav(f)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Roasted Spachcock Chicken                                      :easy:fav:
CLOSED: [2021-05-30 Sun]
:PROPERTIES:
:export_file_name: roasted-spachcock-chicken
:export_hugo_custom_front_matter: :servings 6
:export_hugo_custom_front_matter+: :prep-time 5
:export_hugo_custom_front_matter+: :cook-time 45
:export_hugo_custom_front_matter+: :ready-in 50
:END:
This is a really simple way to feed a lot of guests, or have a lot of leftovers. Baked or roasted chicken is delicious. This recipe works well for a barbeque or oven-roasting.

It's worth noting that this roasting and seasoning techiques work well for simple cuts of chicken such as breast, or thighs. I just enjoy doing a whole chicken as you get a lot of meat for the same effort.

*** Ingredients

- A whole chicken
- The lazy kind of seasoned salt. Try to get the "no msg added" kind

*** Directions

1. Pre-heat your oven to 390 degrees farenheit, or start your barbeque.
2. With a pair of kitchen shears, cut alongside the chicken's spine from front-to-back on both sides of the spine. The goal is to remove the spine entirely.
3. Turn the chicken over and spread the now opened back of the chicken with your fingers. Use your thumbs to apply pressure to the sternum between the breasts on the front of the chicken. Apply enough pressure to hear the front of the ribs crack.
4. Lay the chicken down with the inside facing down and use the palm of your hand to apply more pressure to the checks to ensure that the back-side of the chicken's ribs lay fully flat.
5. Apply a generous amount of the seasoned salt to all areas of the chicken.
6. If you're using an oven, cook the chicken for about 35-50 minutes, or until the internal temperature of the chicken is 160ish Farenheit. If you're aiming for the right temperature, be sure to test near the bone and watch for signs of raw chicken when you take the thermometer out.
7. If you're using a barbeque, the directions are pretty much the same unless you're cooking with charcoal. Be extra diligent and take your time with roasting on charcoal, be sure to use a generous amount of charcoal brickettes/lumped coal. Charcoal grilling takes about an hour.
8. Serve with any sides you like. I enjoy rice and roasted vegetables.

